Ok, from 2.3 this is what is happening:

```
$ terraform init
Initializing the backend...
Initializing modules...
Initializing provider plugins...
- Reusing previous version of ilert/ilert from the dependency lock file
- Using previously-installed ilert/ilert v2.3.0
```

from the plan the output looks like this, note delay_sec is not configured at all in the code.

```
  # module.xxx.ilert_alert_action.alert_actions["yyy"] will be created
  + resource "ilert_alert_action" "alert_actions" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + name          = "Update service and status page"
      + trigger_mode  = "AUTOMATIC"
      + trigger_types = [
          + "alert-created",
          + "alert-acknowledged",
          + "alert-auto-resolved",
          + "alert-resolved",
        ]
      + updated_at    = (known after apply)
      + alert_source {
          + id = (known after apply)
        }
      + automation_rule {
          + alert_type        = "CREATED"
          + resolve_incident  = true
          + send_notification = false
          + service_ids       = (known after apply)
          + service_status    = "PARTIAL_OUTAGE"
          + template_id       = (known after apply)
        }
      + connector {
          + type = "automation_rule"
        }
    }
```

Result from apply is as follows:

```
Error: [ERROR] Can't set field 'delay_sec' when trigger types do not include type 'alert-escalation-ended'
│
│   with module.xxx.ilert_alert_action.alert_actions["yyy"],
│   on .terraform\modules\xxx\modules\monitoring\ilert\resources.tf line 76, in resource "ilert_alert_action" "alert_actions":
│   76: resource "ilert_alert_action" "alert_actions" {
```